spec/support/vcr_cassettes/bgs/vnp_relationships/create/death.yml

---
http_interactions:
- request:
    method: get
    uri: <BGS_BASE_URL>/VnpPtcpntRlnshpWebServiceBean/VnpPtcpntRlnshpService?WSDL
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Host:
      - ".vba.va.gov"
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Sat, 18 Jul 2020 03:03:42 GMT
      Server:
      - Apache
      X-Frame-Options:
      - SAMEORIGIN
      Transfer-Encoding:
      - chunked
      Content-Type:
      - text/xml;charset=utf-8
    body:
      encoding: UTF-8
      string: |-
        <?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.3.0-b170407.2038 svn-revision#2eaca54d17a59d265c6fe886b7fd0027836c766c. --><!-- Generated by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.3.0-b170407.2038 svn-revision#2eaca54d17a59d265c6fe886b7fd0027836c766c. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://ptcpntRlnshpService.services.vonapp.vba.va.gov/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://ptcpntRlnshpService.services.vonapp.vba.va.gov/" name="VnpPtcpntRlnshpService">
        <types>
        <xsd:schema>
        <xsd:import namespace="http://ptcpntRlnshpService.services.vonapp.vba.va.gov/" schemaLocation="http://linktestbepbenefits.vba.va.gov:80/VnpPtcpntRlnshpWebServiceBean/VnpPtcpntRlnshpService?xsd=1"/>
        </xsd:schema>
        </types>
        <message name="vnpPtcpntRlnshpFindByPrimaryKey">
        <part name="parameters" element="tns:vnpPtcpntRlnshpFindByPrimaryKey"/>
        </message>
        <message name="vnpPtcpntRlnshpFindByPrimaryKeyResponse">
        <part name="parameters" element="tns:vnpPtcpntRlnshpFindByPrimaryKeyResponse"/>
        </message>
        <message name="MessageFaultException">
        <part name="fault" element="tns:MessageFaultException"/>
        </message>
        <message name="findAllAsArray">
        <part name="parameters" element="tns:findAllAsArray"/>
        </message>
        <message name="findAllAsArrayResponse">
        <part name="parameters" element="tns:findAllAsArrayResponse"/>
        </message>
        <message name="vnpPtcpntRlnshpCreate">
        <part name="parameters" element="tns:vnpPtcpntRlnshpCreate"/>
        </message>
        <message name="vnpPtcpntRlnshpCreateResponse">
        <part name="parameters" element="tns:vnpPtcpntRlnshpCreateResponse"/>
        </message>
        <message name="vnpPtcpntRlnshpUpdate">
        <part name="parameters" element="tns:vnpPtcpntRlnshpUpdate"/>
        </message>
        <message name="vnpPtcpntRlnshpUpdateResponse">
        <part name="parameters" element="tns:vnpPtcpntRlnshpUpdateResponse"/>
        </message>
        <message name="vnpPtcpntRlnshpRemove">
        <part name="parameters" element="tns:vnpPtcpntRlnshpRemove"/>
        </message>
        <message name="vnpPtcpntRlnshpRemoveResponse">
        <part name="parameters" element="tns:vnpPtcpntRlnshpRemoveResponse"/>
        </message>
        <portType name="VnpPtcpntRlnshpService">
        <operation name="vnpPtcpntRlnshpFindByPrimaryKey">
        <input wsam:Action="http://ptcpntRlnshpService.services.vonapp.vba.va.gov/VnpPtcpntRlnshpService/vnpPtcpntRlnshpFindByPrimaryKeyRequest" message="tns:vnpPtcpntRlnshpFindByPrimaryKey"/>
        <output wsam:Action="http://ptcpntRlnshpService.services.vonapp.vba.va.gov/VnpPtcpntRlnshpService/vnpPtcpntRlnshpFindByPrimaryKeyResponse" message="tns:vnpPtcpntRlnshpFindByPrimaryKeyResponse"/>
        <fault message="tns:MessageFaultException" name="MessageFaultException" wsam:Action="http://ptcpntRlnshpService.services.vonapp.vba.va.gov/VnpPtcpntRlnshpService/vnpPtcpntRlnshpFindByPrimaryKey/Fault/MessageFaultException"/>
        </operation>
        <operation name="findAllAsArray">
        <input wsam:Action="http://ptcpntRlnshpService.services.vonapp.vba.va.gov/VnpPtcpntRlnshpService/findAllAsArrayRequest" message="tns:findAllAsArray"/>
        <output wsam:Action="http://ptcpntRlnshpService.services.vonapp.vba.va.gov/VnpPtcpntRlnshpService/findAllAsArrayResponse" message="tns:findAllAsArrayResponse"/>
        <fault message="tns:MessageFaultException" name="MessageFaultException" wsam:Action="http://ptcpntRlnshpService.services.vonapp.vba.va.gov/VnpPtcpntRlnshpService/findAllAsArray/Fault/MessageFaultException"/>
        </operation>
        <operation name="vnpPtcpntRlnshpCreate">
        <input wsam:Action="http://ptcpntRlnshpService.services.vonapp.vba.va.gov/VnpPtcpntRlnshpService/vnpPtcpntRlnshpCreateRequest" message="tns:vnpPtcpntRlnshpCreate"/>
        <output wsam:Action="http://ptcpntRlnshpService.services.vonapp.vba.va.gov/VnpPtcpntRlnshpService/vnpPtcpntRlnshpCreateResponse" message="tns:vnpPtcpntRlnshpCreateResponse"/>
        <fault message="tns:MessageFaultException" name="MessageFaultException" wsam:Action="http://ptcpntRlnshpService.services.vonapp.vba.va.gov/VnpPtcpntRlnshpService/vnpPtcpntRlnshpCreate/Fault/MessageFaultException"/>
        </operation>
        <operation name="vnpPtcpntRlnshpUpdate">
        <input wsam:Action="http://ptcpntRlnshpService.services.vonapp.vba.va.gov/VnpPtcpntRlnshpService/vnpPtcpntRlnshpUpdateRequest" message="tns:vnpPtcpntRlnshpUpdate"/>
        <output wsam:Action="http://ptcpntRlnshpService.services.vonapp.vba.va.gov/VnpPtcpntRlnshpService/vnpPtcpntRlnshpUpdateResponse" message="tns:vnpPtcpntRlnshpUpdateResponse"/>
        <fault message="tns:MessageFaultException" name="MessageFaultException" wsam:Action="http://ptcpntRlnshpService.services.vonapp.vba.va.gov/VnpPtcpntRlnshpService/vnpPtcpntRlnshpUpdate/Fault/MessageFaultException"/>
        </operation>
        <operation name="vnpPtcpntRlnshpRemove">
        <input wsam:Action="http://ptcpntRlnshpService.services.vonapp.vba.va.gov/VnpPtcpntRlnshpService/vnpPtcpntRlnshpRemoveRequest" message="tns:vnpPtcpntRlnshpRemove"/>
        <output wsam:Action="http://ptcpntRlnshpService.services.vonapp.vba.va.gov/VnpPtcpntRlnshpService/vnpPtcpntRlnshpRemoveResponse" message="tns:vnpPtcpntRlnshpRemoveResponse"/>
        <fault message="tns:MessageFaultException" name="MessageFaultException" wsam:Action="http://ptcpntRlnshpService.services.vonapp.vba.va.gov/VnpPtcpntRlnshpService/vnpPtcpntRlnshpRemove/Fault/MessageFaultException"/>
        </operation>
        </portType>
        <binding name="VnpPtcpntRlnshpServicePortBinding" type="tns:VnpPtcpntRlnshpService">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
        <operation name="vnpPtcpntRlnshpFindByPrimaryKey">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageFaultException">
        <soap:fault name="MessageFaultException" use="literal"/>
        </fault>
        </operation>
        <operation name="findAllAsArray">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageFaultException">
        <soap:fault name="MessageFaultException" use="literal"/>
        </fault>
        </operation>
        <operation name="vnpPtcpntRlnshpCreate">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageFaultException">
        <soap:fault name="MessageFaultException" use="literal"/>
        </fault>
        </operation>
        <operation name="vnpPtcpntRlnshpUpdate">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageFaultException">
        <soap:fault name="MessageFaultException" use="literal"/>
        </fault>
        </operation>
        <operation name="vnpPtcpntRlnshpRemove">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageFaultException">
        <soap:fault name="MessageFaultException" use="literal"/>
        </fault>
        </operation>
        </binding>
        <service name="VnpPtcpntRlnshpService">
        <port name="VnpPtcpntRlnshpServicePort" binding="tns:VnpPtcpntRlnshpServicePortBinding">
        <soap:address location="http://linktestbepbenefits.vba.va.gov:80/VnpPtcpntRlnshpWebServiceBean/VnpPtcpntRlnshpService"/>
        </port>
        </service>
        </definitions>
  recorded_at: Sat, 18 Jul 2020 03:03:42 GMT
- request:
    method: post
    uri: <BGS_BASE_URL>/VnpPtcpntRlnshpWebServiceBean/VnpPtcpntRlnshpService
    body:
      encoding: UTF-8
      string: |-
        <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://ptcpntRlnshpService.services.vonapp.vba.va.gov/" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"><env:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
          <wsse:UsernameToken>
            <wsse:Username>VAgovAPI</wsse:Username>
          </wsse:UsernameToken>
          <vaws:VaServiceHeaders xmlns:vaws="http://vbawebservices.vba.va.gov/vawss">
            <vaws:CLIENT_MACHINE>10.0.0.149</vaws:CLIENT_MACHINE>
            <vaws:STN_ID>281</vaws:STN_ID>
            <vaws:applicationName>VAgovAPI</vaws:applicationName>
            <vaws:ExternalUid>24027663798327182</vaws:ExternalUid>
            <vaws:ExternalKey>abraham.lincoln@vets.gov</vaws:ExternalKey>
          </vaws:VaServiceHeaders>
        </wsse:Security>
        </env:Header><env:Body><tns:vnpPtcpntRlnshpCreate><arg0><vnpProcId>3828033</vnpProcId><vnpPtcpntIdA>146189</vnpPtcpntIdA><vnpPtcpntIdB>146189</vnpPtcpntIdB><ptcpntRlnshpTypeNm>Spouse</ptcpntRlnshpTypeNm><familyRlnshpTypeNm>Spouse</familyRlnshpTypeNm><eventDt>2001-02-03T00:00:00-05:00</eventDt><beginDt xsi:nil="true"/><endDt xsi:nil="true"/><marageStateCd xsi:nil="true"/><marageCityNm xsi:nil="true"/><marageTrmntnStateCd xsi:nil="true"/><marageTrmntnCityNm xsi:nil="true"/><marageTrmntnTypeCd>Death</marageTrmntnTypeCd><mthlySupportFromVetAmt xsi:nil="true"/><jrnDt>2020-07-18T03:03:41Z</jrnDt><jrnLctnId>281</jrnLctnId><jrnStatusTypeCd>U</jrnStatusTypeCd><jrnUserId>VAgovAPI</jrnUserId><jrnObjId>VAgovAPI</jrnObjId><ssn>796043735</ssn></arg0></tns:vnpPtcpntRlnshpCreate></env:Body></env:Envelope>
    headers:
      Host:
      - ".vba.va.gov"
      Soapaction:
      - '"vnpPtcpntRlnshpCreate"'
      Content-Type:
      - text/xml;charset=UTF-8
      Content-Length:
      - '1684'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Sat, 18 Jul 2020 03:03:43 GMT
      Server:
      - Apache
      X-Frame-Options:
      - SAMEORIGIN
      Transfer-Encoding:
      - chunked
      Content-Type:
      - text/xml; charset=utf-8
    body:
      encoding: UTF-8
      string: <?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><env:Header><work:WorkContext
        xmlns:work="http://oracle.com/weblogic/soap/workarea/">rO0ABXdKABR3ZWJsb2dpYy5hcHAudm5wLWVhcgAAANYAAAAjd2VibG9naWMud29ya2FyZWEuU3RyaW5nV29ya0NvbnRleHQABTIuMC44AAA=</work:WorkContext></env:Header><S:Body><ns0:vnpPtcpntRlnshpCreateResponse
        xmlns:ns0="http://ptcpntRlnshpService.services.vonapp.vba.va.gov/"><return><vnpPtcpntRlnshpId>78529</vnpPtcpntRlnshpId><eventDt>2001-02-03T00:00:00-05:00</eventDt><familyRlnshpTypeNm>Spouse</familyRlnshpTypeNm><jrnDt>2020-07-18T03:03:41Z</jrnDt><jrnLctnId>281</jrnLctnId><jrnObjId>VAgovAPI</jrnObjId><jrnStatusTypeCd>U</jrnStatusTypeCd><jrnUserId>VAgovAPI</jrnUserId><marageTrmntnTypeCd>Death</marageTrmntnTypeCd><ptcpntRlnshpTypeNm>Spouse</ptcpntRlnshpTypeNm><vnpProcId>3828033</vnpProcId><vnpPtcpntIdA>146189</vnpPtcpntIdA><vnpPtcpntIdB>146189</vnpPtcpntIdB></return></ns0:vnpPtcpntRlnshpCreateResponse></S:Body></S:Envelope>
  recorded_at: Sat, 18 Jul 2020 03:03:43 GMT
recorded_with: VCR 6.0.0
